#+TITLE: SPL - a Simple Programming Language
#+AUTHOR: Eirik Ravnås

** Hello world! 
Let's us start with getting the basics up and running. We shall use NASM as our
assembler. How do we do input and output from a linux terminal? Let us begin with
input. The below code shows a hello world program in assembly:
#+srcname: hello_world 
#+begin_src asm :tangle src/hello.asm :noweb yes
  section .text                           ;section declaration
  
                                  ;we must export the entry point to the ELF linker or
          global _start       ;loader. They conventionally recognize _start as their
                                  ;entry point. Use ld -e foo to override the default.
  
  _start:
  
          ;write our string to stdout
  
          mov     edx,len ;third argument: message length
          mov     ecx,msg ;second argument: pointer to message to write
          mov     ebx,1   ;first argument: file handle (stdout)
          mov     eax,4   ;system call number (sys_write)
          int     0x80    ;call kernel
  
          ;and exit
  
          mov     ebx,0   ;first syscall argument: exit code
          mov     eax,1   ;system call number (sys_exit)
          int     0x80    ;call kernel
  
  section .data                           ;section declaration
  
          msg     db      "Hello, world!",0xa     ;our dear string
          len     equ     $ - msg                 ;length of our dear string
#+end_src 
Now lets compile it by executing the following shell command:
#+begin_src sh 
  cd src
  nasm -f elf64 hello.asm
  ld -s -o hello hello.o
  ./hello
  cd ..
#+end_src

#+results:
| Hello | world! |

First of all we need to know about sections. Different type of data should
be placed in diffent sections;
| section | Description                                                     |
|---------+-----------------------------------------------------------------|
| .text   | should contain only code                                        |
| .data   | should contain constants (data that does not change at runtime) |
| .bss    | should contain variables (data that does change at runtime)     |
|---------+-----------------------------------------------------------------|
The next thing to notice is the *global* word. It tells the system where
the entry point for the program is (like c's main function).
The next is to know that output is handled by setting up some machine registers
with information, then calling a software interrupt which calls interrupt
routines implemented in the operating system (here linux) to do useful stuff.
In the above code there are two such operations; the first is to print a string
to standard output (terminal), and the second is to exit the program by returning
0 (which tells the operating system that the program exited correctly). If a program
exists by some fault, we should use a number other than 0 as an error code.  
These are the most important stuff to be learned from the hello world example, the
rest is basically about knowing your CPU and NASM syntax. 

The equivalent (with respect to result) code in C is given below:
#+srcname: hello_world 
#+begin_src c :tangle src/helloc.c :noweb yes
  #include <stdio.h>
  
  int main()
  {
     printf("Hello World!\n");
  }
#+end_src
It can be compiled and run with:
#+begin_src sh 
  cd src
  gcc -o helloc.out helloc.c
  ./helloc.out
  cd ..
#+end_src


** Benchmarks
It is interesting to compare size of the two binaries produced by the assembly
code and the C code respectively. As well run a benchmark on a relatively large
text file "test.txt" which is about 8.8mB. Test results are summarized below:  
#+TBLNAME: filecopy-benchmark
| Program   | Size of binary (bytes) | Real time (s) | User time (s) | System time (s) |
|-----------+------------------------+---------------+---------------+-----------------|
| filecopyc |                   7100 |         3.536 |         2.836 |           0.224 |
| filecopy  |                    828 |        675.08 |        13.169 |         403.369 |
|-----------+------------------------+---------------+---------------+-----------------|
#+TBLFM: $3=11*60 + 15.08::$5=6*60+43.369
What happened there! We try to limit the amount of system calls by modifying
our code so that a buffer of maximum 8192 bytes are used. The code is listed 
below. 

#+srcname: filecopy2
#+begin_src asm :tangle src/filecopy2.asm :noweb yes                                          
  section .text                           ;section declaration
      
                                      ;we must export the entry point to the ELF linker or
              global _start       ;loader. They conventionally recognize _start as their
                                      ;entry point. Use ld -e foo to override the default.
      
  _start:
              ;; Fist let's take care of the stack
              pop ebx                                             ;argc 
              ;; we check that the number of arguments are 2 (file1 file2), otherwise just exit (no error message sent).
              cmp ebx, 2
              je  _exit0                                          ;jump if equal
              pop ebx                                             ;program name (irrelevant)
              pop ebx                                             ; file 1
              
              ;; now open it
              mov eax, 5                                          ;system call open
              mov ecx, 0                                          ; O_RDONLY 
              int 80h                                             ; call kernel
      
              ;; Now we need to check that the value returned in eax is valid (not negative)
              ;; to do this we can use the TEST instruction basically performs an AND operation without modifying registers other than flag registers. By writing test eax, eax, the signed flag should be set if -1 was returned to eax.
              test eax, eax
              js   _failopen1                                         ;if signed - just exit
              ;; otherwise ensure to save the file descriptor
              mov [file1], eax
              ;; Now we open the next file, with the same procedure
              pop ebx                                             ; file 2
              
              ;; now open it
              mov eax, 5                                          ;system call open
              mov ecx, 1                                          ; O_WRONLY 
              or  ecx, 100                                        ; O_CREAT
              mov edx, 777                                        ; all permissions granted
              int 80h                                             ; call kernel
      
              test eax, eax
              js   _failopen2                                         ;if signed - just close the first file and exit
              mov [file2], eax
      
  _filecopy:       
            ;; read a character stream into a buffer
            mov eax, 3 ; sys_read
            mov ebx, [file1] ; file descriptor
            mov ecx, buffer                                     ;buffer
            mov edx, 8192 ;length of input stream accepted
            int 0x80
      
            ;; Now eax contains the number of characters read, so if eax
            ;; contains 0 we have copied the entire file and can exit
            test eax, eax
            js   _failread
            jz   _close2
            ;; write the character
      
            mov edx,eax ;third argument: message length
            mov eax,4   ;system call number (sys_write)
            mov ebx,[file2]   
            mov ecx,buffer ;second argument: pointer to message to write
            int 0x80    ;call kernel
  
            test eax, eax
            js  _failwrite
            jmp _filecopy              
      
  _close2:
             mov eax, 6                                          ;sys_close
             mov ebx, [file2]
             int 0x80
      
  _close1:
              mov eax, 6 
              mov ebx, [file1]
              int 0x80
      
  _exit0: 
              mov     ebx,0   ;first syscall argument: exit code
              mov     eax,1   ;system call number (sys_exit)
              int     0x80    ;call kernel
      
            ;; Error messages
  _failopen1:     
            mov edx,len1 ;third argument: message length
            mov ecx,msg1 ;second argument: pointer to message to write
            mov ebx,1   ;first argument: file handle (stdout)
            mov eax,4   ;system call number (sys_write)
            int 0x80    ;call kernel
            jmp _exit0
    
  _failopen2:     
            mov edx,len2 ;third argument: message length
            mov ecx,msg2 ;second argument: pointer to message to write
            mov ebx,1   ;first argument: file handle (stdout)
            mov eax,4   ;system call number (sys_write)
            int 0x80    ;call kernel
            jmp _close1
    
  _failwrite:     
            mov edx,len3 ;third argument: message length
            mov ecx,msg3 ;second argument: pointer to message to write
            mov ebx,1   ;first argument: file handle (stdout)
            mov eax,4   ;system call number (sys_write)
            int 0x80    ;call kernel
            jmp _close2
            
  _failread:     
            mov edx,len4 ;third argument: message length
            mov ecx,msg4 ;second argument: pointer to message to write
            mov ebx,1   ;first argument: file handle (stdout)
            mov eax,4   ;system call number (sys_write)
            int 0x80    ;call kernel
            jmp _close2
    
  section .data                           ;section declaration
    
            msg1     db      "Fail to open file 1",0xa     ;our dear string
            len1     equ     $ - msg1                 ;length of our dear string
            msg2     db      "Fail to open file 2",0xa     ;our dear string
            len2     equ     $ - msg2                 ;length of our dear string
            msg3     db      "Fail to write to file",0xa     ;our dear string
            len3     equ     $ - msg3                 ;length of our dear string
            msg4     db      "Fail to read to file",0xa     ;our dear string
            len4     equ     $ - msg4                 ;length of our dear string
            msg5     db      "Debug",0xa     ;our dear string
            len5     equ     $ - msg5                 ;length of our dear string
    
  section .bss
      
              buffer  resb 8192  
              file1   resb 4
              file2   resb 4
      
    
  
#+end_src
Now lets compile it by executing the following shell command:
#+begin_src sh 
  cd src
  nasm -f elf64 filecopy2.asm
  ld -s -o filecopy2 filecopy2.o
  cd ..
#+end_src

#+TBLNAME: filecopy-benchmark2
| Program   | Size of binary (bytes) | Real time (s) | User time (s) | System time (s) |
|-----------+------------------------+---------------+---------------+-----------------|
| filecopyc |                   7100 |         3.536 |         2.836 |           0.224 |
| filecopy  |                    828 |        675.08 |        13.169 |         403.369 |
| filecopy2 |                    736 |         0.233 |         0.004 |           0.144 |
|-----------+------------------------+---------------+---------------+-----------------|
We see a huge difference in performance! And we easily beat the C code this time.
The lesson leared from this is that we should always try to optimize system calls!

